app/controllers/stories_controller.rb

INSERT INTO "stories" ("code", "title", "position", "body", "created_at", "updated_at") VALUES ('F', 'Friends', 1, 'Just friends. Boring story.', '2011-06-26 02:54:44.927009', '2011-06-26 02:54:44.927009')
SELECT 1 FROM "stories" WHERE ("stories"."position" = 1) LIMIT 1
---
  def create
    @story = Story.new(params[:story])
    if @story.save
      flash[:notice] = "The new story for result '#{@story.code}', position #{@story.position} has been created."
      redirect_to stories_path
    else
      flash[:error] = @story.errors.full_messages.join("; ")

SELECT "stories".* FROM "stories" ORDER BY code ASC, position ASC
---
  def index
    @stories = Story.order("code ASC, position ASC")